Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotLineWidth
The  Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotLineWidth enum specifies all possible line width's.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotLineWidth.Thin
The width of a thin line.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotLineWidth.Medium
The width of a medium wide line.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotLineWidth.Thick
The width of a thick line.